{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "pygame 1.9.6\n",
      "Hello from the pygame community. https://www.pygame.org/contribute.html\n"
     ]
    }
   ],
   "source": [
    "import json\n",
    "from ibm_watson import LanguageTranslatorV3\n",
    "from ibm_watson import AssistantV2\n",
    "from ibm_watson import TextToSpeechV1\n",
    "from ibm_cloud_sdk_core.authenticators import IAMAuthenticator\n",
    "from ibm_watson.websocket import SynthesizeCallback\n",
    "from os.path import join, dirname\n",
    "import pygame\n",
    "from neo4j import GraphDatabase\n",
    "from pandas import DataFrame\n",
    "from clips import Environment\n",
    "from tkinter import ttk, messagebox\n",
    "from PIL import Image, ImageTk\n",
    "from tkinter import *"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Autenticación y credenciales de los servicios en IBM Watson"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "#ATENTICACIÓN TRANSLATE WATSON\n",
    "authenticator = IAMAuthenticator('ex7fG5d2ob2SpeqnBatbjrloOjiD3fruLReO-zipIRG8')\n",
    "language_translator = LanguageTranslatorV3(\n",
    "    version='2018-05-01',\n",
    "    authenticator=authenticator)\n",
    "language_translator.set_service_url('https://api.us-south.language-translator.watson.cloud.ibm.com/instances/3f020a13-ae1f-4d67-87f2-808add2359f5')\n",
    "\n",
    "#ATENTICACIÓN TEXT_TO_SPEECH WATSON\n",
    "authenticator = IAMAuthenticator('y6g3Klma5riCxg7RWDp2UUsT9HCW07iaT2qruSdOuTwg')\n",
    "text_to_speech = TextToSpeechV1( authenticator=authenticator)\n",
    "text_to_speech.set_service_url('https://api.us-south.text-to-speech.watson.cloud.ibm.com/instances/6ddfab7b-3699-484e-801b-b2cbcf8cab1c')\n",
    "\n",
    "\n",
    "#ATENTICACIÓN ASSISTANT WATSON\n",
    "authenticator = IAMAuthenticator('Vdhmwp71ttlef0bM0JCAVGM1-jqVEt-sQlHqrWFFo_HO')\n",
    "assistant = AssistantV2(\n",
    "    version = '2020-04-01',\n",
    "    authenticator = authenticator\n",
    ")\n",
    "assistant.set_service_url('https://api.us-south.assistant.watson.cloud.ibm.com/instances/d80a5eb7-c2a1-43d2-84c0-9891733fc13d')\n",
    "assistant.set_disable_ssl_verification(False)\n",
    "\n",
    "session = assistant.create_session('5d54ad00-095a-4d6f-b630-5bb1bb72fea1').get_result()\n",
    "\n",
    "voices = text_to_speech.list_voices().get_result()\n",
    "#print(json.dumps(voices, indent=2))\n",
    "\n",
    "\n",
    "#AUTENTICACION NEO4J\n",
    "uri = \"bolt://localhost:7687\"\n",
    "# Connect to the neo4j database server\n",
    "\n",
    "graphDB_Driver  = GraphDatabase.driver(uri)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## UPDATE\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "comand_delete = 'MATCH (n) OPTIONAL MATCH (n)-[r]-() DELETE n,r RETURN count(n) as numero'\n",
    "\n",
    "with graphDB_Driver.session() as graphDB_Session:\n",
    "    \n",
    "    result = graphDB_Session.run(comand_delete)\n",
    "    print (result)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# INTEGRACION NEO4J"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## CREATE"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record personas=1>\n"
     ]
    }
   ],
   "source": [
    "cqlCreate = \"\"\"Create (h:Persona {gender:'Hombre',age:25 }),\n",
    "    (m:Persona {gender:'Mujer', age:22}), \n",
    "    (q:Motivation {description:'Mejorar la educacion'}),\n",
    "    (n:Motivation {description:'Vocacion de enseniar'}),\n",
    "    (h)-[:RELATION {value: 3}]->(q),\n",
    "    (h)-[:RELATION {value: 1}]->(n),\n",
    "    (m)-[:RELATION {value: 5}]->(n)\n",
    "    RETURN COUNT(h) AS personas\"\"\"\n",
    "\n",
    "with graphDB_Driver.session() as graphDB_Session:\n",
    "    \n",
    "    # LISTA LOS NODOS CREADOS\n",
    "    nodes = graphDB_Session.run(cqlCreate)\n",
    "    \n",
    "    record = nodes.single()\n",
    "    print(record)\n",
    "    "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## UPDATE"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "pesos=[]\n",
    "\n",
    "\n",
    "\n",
    "def merge_mujer(desc, value):\n",
    "\n",
    "    cql_update_query = \"\"\"MERGE  (m:Persona {gender:'Mujer', age:22})\n",
    "                    MERGE (q2:Motivation{description:$desc})\n",
    "                    MERGE (m)-[r:RELATION]->(q2)\n",
    "                    SET r += {value:$value}\n",
    "                    RETURN *\"\"\"\n",
    "\n",
    "    with graphDB_Driver.session() as graphDB_Session:\n",
    "\n",
    "        # LISTA LOS NODOS CREADOS\n",
    "        nodes = graphDB_Session.run(cql_update_query, desc=desc, value=value )\n",
    "        result = nodes.keys()\n",
    "        print(result)\n",
    "\n",
    "def merge_hombre(desc, value):\n",
    "    cql_update_query = \"\"\"MERGE  (h:Persona {gender:'Hombre', age:25})\n",
    "                    MERGE (q3:Motivation{description:$desc})\n",
    "                    MERGE (h)-[r:RELATION]->(q3)\n",
    "                    SET r += {value:$value}\n",
    "                    RETURN *\"\"\"\n",
    "\n",
    "    with graphDB_Driver.session() as graphDB_Session:\n",
    "\n",
    "        # LISTA LOS NODOS CREADOS\n",
    "        nodes = graphDB_Session.run(cql_update_query, desc=desc, value=value )\n",
    "        result = nodes.keys()\n",
    "        print(result)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## READ"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record (m.description)='Vocacion de enseniar'>,\n",
       " <Record (m.description)='Mejorar la educacion'>]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# CQL to query all the universities present in the graph\n",
    "values = []\n",
    "attribute=[]\n",
    "pesos=[]\n",
    "def list_conditional(gender):\n",
    "    cqlEdgeQuery = \"match (:Persona {gender: $gender})-->(m:Motivation) return (m.description)\"\n",
    "\n",
    "    with graphDB_Driver.session() as graphDB_Session:\n",
    "\n",
    "        nodes = graphDB_Session.run(cqlEdgeQuery, gender=gender)\n",
    "        for node in nodes:\n",
    "            values.append(node)\n",
    "        return values\n",
    "        \"\"\"if gender == 'Hombre':\n",
    "            desc = input(\"Por que escogio esta carrera? \" )\n",
    "            value = input(\"ingrese valor: \")\n",
    "            merge_hombre(desc, value)\"\"\"\n",
    "        \n",
    "        \n",
    "def values(desc, gender):\n",
    "    cqlEdgeQuery = \"MATCH (m)-[r:RELATION]->(q2:Motivation) where q2.description =$desc  RETURN (r.value)\"\n",
    "    with graphDB_Driver.session() as graphDB_Session:\n",
    "\n",
    "        pesos = graphDB_Session.run(cqlEdgeQuery, desc=desc)\n",
    "        for peso in pesos:\n",
    "            prueba =str(peso)\n",
    "            #prueba.split()\n",
    "            primero=prueba.split(\"=\", 2)\n",
    "            segundo = str(primero[1])\n",
    "            tercero = segundo.split(\">\",1)\n",
    "            cuarto =str(tercero[0])\n",
    "            print(cuarto[0])\n",
    "            valor= int(cuarto[0])\n",
    "            value = valor+1\n",
    "            \n",
    "            \n",
    "        if gender == 'Hombre':\n",
    "            merge_hombre(desc, value)\n",
    "        if gender == 'Mujer':\n",
    "            merge_mujer(desc, value)\n",
    "\n",
    "            \n",
    "            \n",
    "def list_motivations():\n",
    "    values=[]\n",
    "    cqlEdgeQuery = \"MATCH (m:Motivation) RETURN (m.description)\"\n",
    "    with graphDB_Driver.session() as graphDB_Session:\n",
    "\n",
    "        nodes = graphDB_Session.run(cqlEdgeQuery)\n",
    "        for node in nodes:               \n",
    "            values.append(node)\n",
    "            #print(node)\n",
    "        return values\n",
    "    \n",
    "def lis_all():\n",
    "    \n",
    "    cqlNodeQuery = \"MATCH (x) RETURN x\"\n",
    "\n",
    "    # CQL to query the distances from Yale to some of the other Ivy League universitie\n",
    "\n",
    "    with graphDB_Driver.session() as graphDB_Session:\n",
    "\n",
    "        # LISTA LOS NODOS CREADOS\n",
    "        nodes = graphDB_Session.run(cqlNodeQuery)\n",
    "\n",
    "        print(\"Nodos creados:\")\n",
    "\n",
    "        for node in nodes:\n",
    "\n",
    "            print(node)\n",
    "\n",
    "        #LISTAR LAS RELACIONES\n",
    "                \n",
    "#lis_all()\n",
    "#list_conditional('Hombre')\n",
    "list_motivations()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# INTEGRACION CLIPS"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "env = Environment()\n",
    "def expert_system(motivacion):\n",
    "    env.assert_string(\"(motivacion \"+ motivacion +\")\")\n",
    "    #env.assert_string(\"(motivacion  vocacion de ayudar)\")\n",
    "\n",
    "    rule = \"\"\"\n",
    "    (defrule my-rule\n",
    "    (motivacion ayudar)\n",
    "    =>\n",
    "    (printout t \"deberias ingresar a un grupo\" crlf))\n",
    "    \"\"\"\n",
    "\n",
    "    for fact in env.facts():\n",
    "        aux = str(fact)\n",
    "        lower=aux.lower()\n",
    "        #print(lower)\n",
    "        ccc=lower.find('ayudar')\n",
    "        if ccc != -1:\n",
    "            saludo = env.build(rule)\n",
    "            env.run()\n",
    "            return('Deberias ingresar a algun grupo')\n",
    "        ccc=lower.find('vocacion')\n",
    "        if ccc !=-1:\n",
    "            return \"Tendrias que dar tutorias a tus companieros\"\n",
    "    \n",
    "        ccc=lower.find('gusta')\n",
    "        if ccc !=-1:\n",
    "            return \"Te asueguramos que seras un gran docente\"\n",
    "        \n",
    "        ccc=lower.find('educacion')\n",
    "        if ccc !=-1:\n",
    "            return \"Sabemos que la educacion debee mejorar cada dia\"\n",
    "        \n",
    "    env.reset()\n",
    "    env.load(\"examen.clp\")\n",
    "    \n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Identifica el idioma, y traduce de ser el caso"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "#CREAR UNA CONDICIÓN PARA QUE LA CONVERSAIÓN SE DETENGA O CONTINUE\n",
    "condicion=''\n",
    "\n",
    "\n",
    "# CONVERSASIÓN CON ASSISTANT WATSON\n",
    "def assistant_bot(pregunta_persona):\n",
    "    \n",
    "    message = assistant.message(\n",
    "        '5d54ad00-095a-4d6f-b630-5bb1bb72fea1',\n",
    "        session['session_id'],\n",
    "        input={\n",
    "            'message_type':'text',\n",
    "            'text':pregunta_persona\n",
    "        }\n",
    "    ).get_result()\n",
    "    #print(json.dumps(message, indent=2))\n",
    "    # RECORRO EL JSON RESULT Y OBTENGO EL CAMPO GENERIC QUE ES LA RESPUESTA \n",
    "    for key,value in message.items():\n",
    "        for salida in value[\"entities\"]:\n",
    "            salida\n",
    "            \n",
    "            \n",
    "        for entityProperty in value[\"generic\"]:\n",
    "            str(entityProperty)\n",
    "    \n",
    "    condicion  = str(salida) \n",
    "    res_salida = condicion.split(':',2)\n",
    "    respuesta = res_salida[1]\n",
    "    condicion = str(respuesta)\n",
    "    res_final = condicion.split(',',1)\n",
    "    condicion =str(res_final[0])\n",
    "    #print(condicion)\n",
    "    \n",
    "    #TEXTO\n",
    "    response=str(entityProperty)\n",
    "    res=response.split(':',2)\n",
    "    paso_valor=str(res[2])\n",
    "    return paso_valor\n",
    "\n",
    "#VUELVO A TRADUCIR\n",
    "def translate_again(texto):\n",
    "    \n",
    "    translation = language_translator.translate(\n",
    "        text = texto, model_id = 'es-en').get_result()\n",
    "    #print(json.dumps(translation, indent=2, ensure_ascii= False))\n",
    "    texto=translation['translations']\n",
    "    transformado=str(texto)\n",
    "    #print(transformado)\n",
    "    t=transformado.split(\" \", 1)\n",
    "    #print(t[1])\n",
    "    v=str(t[1]).split(\"}\",1)\n",
    "    texto=str(v)\n",
    "    text_speech_en(texto)      #SE PASA DE TEXTO A VOZ \n",
    "    return str(v[0])\n",
    "\n",
    "\n",
    "# FUNCIÓN DE TRADUCIR \n",
    "def translate(texto):\n",
    "    \n",
    "    translation = language_translator.translate(\n",
    "        text = texto, model_id = 'en-es').get_result()\n",
    "    #print(json.dumps(translation, indent=2, ensure_ascii= False))\n",
    "    texto=translation['translations']\n",
    "    transformado=str(texto)\n",
    "   # print(transformado)\n",
    "    t=transformado.split(\" \", 1)\n",
    "    #print(t[1])\n",
    "    v=str(t[1]).split(\"}\",1)\n",
    "    valor_pasar=str(v[0])\n",
    "    return valor_pasar\n",
    "\n",
    "#FUNCIÓN QUE DEVULVE EL TEXTO SIN TRADUCIR\n",
    "def no_translate(texto):\n",
    "    \n",
    "    return texto\n",
    "\n",
    "#PASAR DE TEXTO A VOZ\n",
    "def text_speech_en(texto):\n",
    "    file_path = join( 'resources/output.wav')\n",
    "    with open(file_path,'wb') as audio_file:\n",
    "        response = text_to_speech.synthesize(\n",
    "            texto, accept='audio/wav',\n",
    "            voice=\"en-US_AllisonVoice\").get_result()\n",
    "        audio_file.write(response.content)\n",
    "        \n",
    "        \n",
    "        \n",
    "def text_speech_es(texto):\n",
    "    file_path = join( 'resources/output.wav')\n",
    "    with open(file_path,'wb') as audio_file:\n",
    "        response = text_to_speech.synthesize(\n",
    "            texto, accept='audio/wav',\n",
    "            voice=\"es-LA_SofiaVoice\").get_result()\n",
    "        audio_file.write(response.content)\n",
    "        \n",
    "def play_audio():\n",
    "    pygame.mixer.init()\n",
    "    pygame.mixer.music.load(\"resources/output.wav\")\n",
    "    pygame.mixer.music.play()\n",
    "    pygame.event.wait()\n",
    "\n",
    "\n",
    "\n",
    "def main():\n",
    "    print('Escribe algo: ')\n",
    "    print('Write something: ')\n",
    "   # print(condicion+\" main\")\n",
    "    while str(condicion) != 'despedida':\n",
    "        texto=input()\n",
    "        #print(texto)\n",
    "        language = language_translator.identify(\n",
    "            texto).get_result()\n",
    "        value_language=[]\n",
    "        for key,value in language.items():\n",
    "            for lenguage_iden in value:\n",
    "                values=lenguage_iden.values()\n",
    "                language_list=list(values)\n",
    "                value_language.append(language_list[0])\n",
    "        if value_language[0] == 'en':\n",
    "            #print(translate(texto))\n",
    "            pregunta_persona=translate(texto)\n",
    "            #print(assistant_bot(pregunta_persona))\n",
    "            try:\n",
    "                texto=assistant_bot(pregunta_persona)\n",
    "                print(translate_again(texto))\n",
    "                return(translate_again(texto))\n",
    "            except:\n",
    "                #print(assistant_bot(pregunta_persona))\n",
    "                print('Quizá la pregunta no está bien formulada')\n",
    "                return (('Maybe the question is not fine formuled'))\n",
    "            \n",
    "            #\n",
    "        elif value_language[0] == 'es':\n",
    "            #print(no_translate(texto))\n",
    "            pregunta_persona=no_translate(texto)\n",
    "            \n",
    "            try:\n",
    "                texto=assistant_bot(pregunta_persona)\n",
    "                print(texto)\n",
    "                return texto\n",
    "            except:\n",
    "                #print(assistant_bot(pregunta_persona))\n",
    "                print('Quizá la pregunta no está bien formulada')\n",
    "                return ('Quizá la pregunta no está bien formulada')\n",
    "            text_speech_es(texto)\n",
    "#play_audio()\n",
    "main()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Recibo el texto y traduzco de español a inglés"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'NoneType'>\n",
      "good morningpreunta\n",
      "Escribe algo: \n",
      "Write something: \n",
      "good morning\n",
      "\" 'Welcome to the U.P.S. Basic Education career'\n"
     ]
    }
   ],
   "source": [
    "from functools import partial\n",
    "window = Tk()\n",
    "\n",
    "valor_text1=\"\"\n",
    "window.title(\"Chat Bot U.P.S \")\n",
    "window.geometry('800x800')\n",
    "\n",
    "\n",
    "\n",
    "tab_control = ttk.Notebook(window)\n",
    "\n",
    "tab1 = ttk.Frame(tab_control)\n",
    "\n",
    "tab2 = ttk.Frame(tab_control)\n",
    "\n",
    "tab_control.add(tab1, text='Usuario')\n",
    "\n",
    "chat = Text(tab1, height=30, width=30).place(x=250, y=300)\n",
    "print(type(chat))\n",
    "S = ttk.Scrollbar(chat)\n",
    "\n",
    "\n",
    "lbl_information = ttk.Label(tab1, text= \"\")\n",
    "\n",
    "tab_control.add(tab2, text='Estudiante')\n",
    "\n",
    "lbl2 = Label(tab2, text= 'label2')\n",
    "\n",
    "lbl2.grid(column=0, row=0)\n",
    "\n",
    "tab_control.pack(expand=1, fill='both')\n",
    "opcion = IntVar() # Como StrinVar pero en entero\n",
    "box_value=StringVar()\n",
    "valor_text=StringVar()\n",
    "genero_txt=StringVar()\n",
    "question=StringVar()\n",
    "\n",
    "def neo_j():  \n",
    "    lbl_nombre= Label(tab1, text = \"Ingresa tu nombre \\n Nos ayudara a mejorar nustro servicio\")\n",
    "    gender = ttk.Entry(tab1, textvariable = genero_txt).place(x=50, y=30)\n",
    "    lbl1 = Label(tab1, text= 'Cuentanos, que te motiva a seguir esta carrera?').place(x=15, y = 30)\n",
    "    lbl1 = Label(tab1, text= 'Aqui, algunas respuestas anteriores ').place(x=15, y = 45)\n",
    "    \n",
    "    valores=list_motivations()    \n",
    "    box = ttk.Combobox(tab1,textvariable=box_value, values=valores+[\"Otro\"]).place(x=15, y=60)\n",
    "    \n",
    "    motivaton_txt = ttk.Entry(tab1, textvariable=valor_text).place(x = 200, y =60)\n",
    "    \n",
    "    generos = ['Hombre', 'Mujer']\n",
    "    \n",
    "    box_genero= ttk.Combobox(tab1,textvariable=genero_txt, values=generos).place(x=15, y=75)\n",
    "    \n",
    "    \n",
    "    \n",
    "    b=Button(tab1,text=\"Guardar\", command=get_value, width=20).place(x=250, y=100)\n",
    "    \n",
    "    bl1 = Label(tab1, text= 'Has tu pregunta').place(x=90, y = 185)\n",
    "    ttk.Entry(tab1, textvariable=question).place(x = 90, y =200)\n",
    "    b_question=Button(tab1,text=\"?\", command=chat_bot, width=20).place(x=250, y=200)\n",
    "\n",
    "def chat_bot():\n",
    "    q_cb=question.get()\n",
    "    print(q_cb + \"preunta\")\n",
    "    response=main(q_cb)\n",
    "    #print(response)\n",
    "    (chat, response)\n",
    "    #messagebox.showinfo(message=response, title=\"Recomendacion\")\n",
    "    \n",
    "def get_value():\n",
    "    \n",
    "    mtv_desc = box_value.get()\n",
    "    gndr = genero_txt.get()\n",
    "    \n",
    "    if mtv_desc =='Otro':\n",
    "        motivacion =valor_text.get()\n",
    "        response=expert_system(motivacion)\n",
    "        messagebox.showinfo(message=response, title=\"Recomendacion\")\n",
    "        if gndr == 'Hombre':\n",
    "            merge_hombre(motivacion, 1)\n",
    "        if gndr == 'Mujer':\n",
    "            merge_mujer(motivacion, 1)\n",
    "            \n",
    "        valores=list_motivations()\n",
    "        #messagebox.showinfo(message=\"Mensaje\", title=\"Título\")\n",
    "    else:\n",
    "        primer=mtv_desc.split('{',1)\n",
    "        print(primer[0])\n",
    "        segundo = str(primer[1])\n",
    "        tercero=segundo.split('}',1)\n",
    "        cuarto =str(tercero[0])\n",
    "        motivacion=cuarto\n",
    "        response=expert_system(motivacion)\n",
    "        print(gndr)\n",
    "        values(motivacion, gndr)\n",
    "        messagebox.showinfo(message=response, title=\"Recomendacion\")\n",
    "        \n",
    "\n",
    "#Radiobutton(root, text=\"Opción 1\", variable=opcion, \n",
    "      #      value=1, command=selec).pack()\n",
    "neo_j()\n",
    "window.mainloop()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
